{
  "source": "Curated from Blind, LeetCode Discuss, and Hacker News threads (2020-2023)",
  "module": "Module 4: Software Engineering & System Design",
  "file_type": "private_Source1_ForumDiscussion",
  "segments": {
    "introduction": {
      "level_1": [
        "Q: How to start learning system design? A: Begin with basic scalability concepts - my first project was a URL shortener!",
        "Comment: I failed 3 system design interviews before realizing: ALWAYS clarify requirements first (QPS, latency needs, etc)."
      ],
      "level_2": [
        "Q: SQL vs NoSQL for new app? A: At our startup, we used Postgres until 10K RPS, then added MongoDB for analytics.",
        "Tip: Watch Gaurav Sen's YouTube channel - his cache invalidation video saved me."
      ],
      "level_3": [
        "Q: How detailed should API contracts be? A: At Amazon, we spend 2 weeks on API specs before coding - saves 100+ hours later.",
        "Comment: Our team got burned by not planning for idempotency - 5% of payments were duplicated!"
      ],
      "level_4": [
        "Q: Global data consistency? A: We use CRDTs (conflict-free replicated data types) for our collaborative editor - no locks!",
        "Comment: At Stripe, we handle 500M+ txs/day with 3-second eventual consistency - perfect is the enemy of good."
      ]
    },
    "realWorldUseCases": {
      "level_1": [
        "Q: Real-world CAP theorem example? A: Our outage: Chose AP (DynamoDB), lost cart items during AWS region failover."
      ],
      "level_2": [
        "Comment: Scaled our chat app to 1M users using: 1) Redis pub/sub 2) Read replicas 3) Exponential backoff retries."
      ],
      "level_3": [
        "Q: How does Uber track drivers? A: Ex-Uber here - we used quadtrees for geohashing + Kafka for real-time updates."
      ],
      "level_4": [
        "Comment: At Cloudflare, we shard by customer ID but had to redesign when Elon tweeted - some customers had 1000x more traffic!"
      ]
    },
    "industryApplications": {
      "level_1": [
        "Q: Do startups need system design? A: Yes! Our 5-person team wasted 3 months rebuilding after choosing MongoDB for financial data."
      ],
      "level_2": [
        "Comment: FAANG interviews focus on tradeoffs - I was grilled for 30 mins on why I chose Redis over Memcached for our cache."
      ],
      "level_3": [
        "Q: Healthtech system design? A: HIPAA compliance forced us to: 1) Encrypt PII at rest 2) Audit logs 3) No cross-region replication."
      ],
      "level_4": [
        "Comment: High-frequency trading firm interview asked me to design a system with <100μs latency - used FPGAs + kernel bypass networking."
      ]
    },
    "thinkingPattern": {
      "level_1": [
        "Tip: Always ask 'What's the expected growth?' - our MVP scaled terribly because we assumed linear user growth."
      ],
      "level_2": [
        "Q: How to approach new problems? A: I use: 1) Requirements 2) Back-of-envelope math 3) Diagrams 4) Tradeoffs."
      ],
      "level_3": [
        "Comment: At Google, we spend 70% of design time on failure modes - 'What if cache cluster dies during peak?'"
      ],
      "level_4": [
        "Tip: For distributed systems, always plan for the 'worst normal day' - not just theoretical edge cases."
      ]
    },
    "problemTypes": {
      "level_1": [
        "Q: First system design interview? A: Got asked to design Twitter - completely blanked on how feeds work!"
      ],
      "level_2": [
        "Comment: Common question: 'Design a hotel booking system' - focus on inventory locking and overbooking."
      ],
      "level_3": [
        "Q: Hardest design question? A: 'Design Google Docs' - operational transforms and conflict resolution took 45 mins!"
      ],
      "level_4": [
        "Comment: Hedge fund asked me to design a stock exchange matching engine - order book dynamics are non-trivial!"
      ]
    },
    "assessmentsAndQuizzes": {
      "level_1": [
        "Quiz: If your database can handle 10K RPS and you get 100K RPS, what do you do? (Answer: Add caching, read replicas)"
      ],
      "level_2": [
        "Q: How would you test a rate limiter? A: 1) Unit tests 2) Chaos test 3) Shadow traffic 4) Circuit breakers."
      ],
      "level_3": [
        "Comment: Our take-home: 'Find bottlenecks in this microservice architecture' - the gRPC retries were killing latency."
      ],
      "level_4": [
        "Q: How to interview senior candidates? A: We give them a working system and ask to optimize for 10x scale."
      ]
    },
    "miniProjects": {
      "level_1": [
        "Project Idea: Build a URL shortener with analytics - use Redis for clicks, Postgres for mappings."
      ],
      "level_2": [
        "Comment: I learned more from implementing consistent hashing in Go than any tutorial."
      ],
      "level_3": [
        "Q: Portfolio project for staff eng roles? A: Build a tiny distributed database with Raft/Paxos."
      ],
      "level_4": [
        "Comment: Our team's hackathon project: Multi-region key-value store with CRDTs - won against 20 teams!"
      ]
    },
    "suggestionsAndMistakes": {
      "level_1": [
        "Mistake: We didn't set connection timeouts - one slow API call took down our entire service!"
      ],
      "level_2": [
        "Tip: Always add metrics BEFORE scaling - we couldn't debug our Redis cluster without Prometheus."
      ],
      "level_3": [
        "Mistake: Chose Kafka without understanding partitions - some topics had 100x more traffic than others."
      ],
      "level_4": [
        "Tip: At scale, every millisecond matters - we saved $1M/year by reducing JSON parsing overhead."
      ]
    }
  }
}
