{
  "source": "Course - Developing a Growth Mindset by University of California, Davis (Coursera)",
  "module": "Module 10: Mistake Recovery & Growth Plans",
  "file_type": "public_Source2_Course",
  "reference": "https://www.coursera.org/learn/growth-mindset/",
  "segments": {
    "Introduction": {
      "level_1": [
        "This course introduces the concept of growth mindset, coined by Dr. Carol Dweck.",
        "It highlights how growth mindset differs from fixed mindset in learning and behavior.",
        "Applies the mindset to education, relationships, business, and self-development."
      ],
      "level_2": [
        "Explains how traits like intelligence and creativity can grow with effort and strategy.",
        "Shows fixed mindset examples like avoiding feedback or fearing presentations.",
        "Encourages recognition of fixed mindset in oneself without self-judgment."
      ],
      "level_3": [
        "Growth mindset promotes intellectual curiosity, flexibility, and resilience.",
        "Myths are debunked: growth mindset isn't constant positivity or limitless growth.",
        "Illustrates how praising strategy and effort properly supports long-term learning."
      ],
      "level_4": [
        "Applies mindset to organizations: growth-oriented firms nurture innovation.",
        "Examples include Google, IBM, Amazon prioritizing learning and experimentation.",
        "Growth mindset shifts focus from static talent to developable potential."
      ]
    },
    "Real-World Use Cases": {
      "level_1": [
        "Students tackle difficult subjects by believing they can improve with practice."
      ],
      "level_2": [
        "Employees overcome fear of presentations by reframing it as a learnable skill."
      ],
      "level_3": [
        "Managers give meaningful feedback that emphasizes learning and iteration."
      ],
      "level_4": [
        "Organizations like Airbnb encourage innovation by rewarding learning from failure."
      ]
    },
    "Industry Applications": {
      "level_1": [
        "Entry-level onboarding includes lessons on resilience and adaptive learning."
      ],
      "level_2": [
        "Team leaders support experimentation and safe failure in agile projects."
      ],
      "level_3": [
        "HR departments assess mindset during behavioral interviews and performance reviews."
      ],
      "level_4": [
        "C-level strategy includes talent development pipelines with growth principles."
      ]
    },
    "Thinking Pattern": {
      "level_1": [
        "Ask: Am I seeing this mistake as permanent or as a chance to grow?"
      ],
      "level_2": [
        "Reframe: What can I learn from this setback, and how will I adapt next time?"
      ],
      "level_3": [
        "Reflect: How does my environment reinforce or discourage a growth mindset?"
      ],
      "level_4": [
        "Evaluate: Is my organization promoting development or fixed standards of talent?"
      ]
    },
    "Problem Types": {
      "level_1": [
        "Avoiding new challenges due to fear of failure or incompetence."
      ],
      "level_2": [
        "Believing that traits like creativity or intelligence are fixed at birth."
      ],
      "level_3": [
        "Overemphasizing effort instead of praising strategy and adaptation."
      ],
      "level_4": [
        "Equating growth mindset with company profits instead of people development."
      ]
    },
    "Assessments & Quizzes": {
      "level_1": [
        "What’s the difference between a fixed and growth mindset?"
      ],
      "level_2": [
        "Name one myth about growth mindset and explain why it's inaccurate."
      ],
      "level_3": [
        "Describe how you responded to feedback with either a fixed or growth mindset."
      ],
      "level_4": [
        "How can organizations shift from fixed to growth mindsets in talent development?"
      ]
    },
    "Mini Projects": {
      "level_1": [
        "Write about a challenge you avoided due to fear and reframe it with a growth mindset."
      ],
      "level_2": [
        "Interview someone about how they overcame failure using learning and feedback."
      ],
      "level_3": [
        "Build a reflection tool for teams to discuss fixed vs. growth mindset behaviors."
      ],
      "level_4": [
        "Design a workshop for leadership to promote growth-oriented organizational culture."
      ]
    },
    "Suggestions & Mistakes": {
      "level_1": [
        "Don’t assume growth mindset means you'll never fail or struggle."
      ],
      "level_2": [
        "Avoid praising effort alone — focus on strategies and learning outcomes."
      ],
      "level_3": [
        "Challenge myths like limitless growth or false optimism."
      ],
      "level_4": [
        "Don’t confuse growth mindset with business growth — it’s about people development."
      ]
    }
  }
}
